Revit 2027 API
BuiltInFailures.DimensionFailures.LabelingMultiSegmentWithReporting Property
 Cannot label multi-segment dimensions with reporting parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LabelingMultiSegmentWithReporting { get; }
Public Shared ReadOnly Property LabelingMultiSegmentWithReporting As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LabelingMultiSegmentWithReporting {
	FailureDefinitionId^ get ();
}
static member LabelingMultiSegmentWithReporting : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace